INSERT INTO languages (id, name, code)
VALUES
    (1, 'Русский', 'ru'),
    (2, 'Английский', 'en'),
    (3, 'Французский', 'fr'),
    (4, 'Немецкий', 'de'),
    (5, 'Испанский', 'es'),
    (6, 'Итальянский', 'it'),
    (7, 'Японский', 'ja'),
    (8, 'Китайский', 'zh'),
    (9, 'Корейский', 'ko');


INSERT INTO genres (id, name)
VALUES
    (1, 'Фантастика'),
    (2, 'Приключения'),
    (3, 'Семейный'),
    (4, 'Триллер'),
    (5, 'Драма'),
    (6, 'Комедия'),
    (7, 'Ужасы'),
    (8, 'Боевик'),
    (9, 'Мелодрама'),
    (10, 'Исторический'),
    (11, 'Биография'),
    (12, 'Фэнтези');

INSERT INTO halls (id, name, seat_count)
VALUES
    (1, 'Зал 1', 120),
    (2, 'Зал 2', 80),
    (3, 'Зал 4', 60),
    (4, 'VIP Зал', 40),
    (5, 'IMAX', 200),
    (6, 'Детский Зал', 50);

